chrissicool/zsh-256color
romkatv/powerlevel10k
agkozak/zsh-z
zsh-users/zsh-autosuggestions
zsh-users/zsh-completions
zsh-users/zsh-syntax-highlighting

ohmyzsh/ohmyzsh path:plugins/direnv

# Support for nvm and npm
lukechilds/zsh-nvm
lukechilds/zsh-better-npm-completion
buonomo/yarn-completion
g-plane/zsh-yarn-autocompletions
