tap "buo/cask-upgrade"
tap "dart-lang/dart"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "mas-cli/tap"
tap "mongodb/brew"
tap "sass/sass"
# Shell plugin manager
brew "antibody"
# Library for manipulating PNG images
brew "libpng"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Geometry Engine
brew "geos"
# GNOME XML library
brew "libxml2"
# Adds spatial SQL capabilities to SQLite
brew "libspatialite"
# Package for scientific computing with Python
brew "numpy"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler-qt5"
# Geospatial Data Abstraction Library
brew "gdal"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# C library implementing the SSH2 protocol
brew "libssh2"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Version controlled file system
brew "gitfs"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# CLI for ImageOptim, ImageAlpha and JPEGmini
brew "imageoptim-cli"
# Sophisticated file transfer program
brew "lftp"
# Mac App Store command-line interface
brew "mas"
# Scalable distributed version control system
brew "mercurial"
# Node version management
brew "n", link: false
# Platform built on V8 to build network applications
brew "node"
# Platform built on V8 to build network applications
brew "node@6"
# Python dependency management tool
brew "pipenv"
# Cross-platform application and UI framework
brew "qt"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@2", link: false
# Software environment for statistical computing
brew "r"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: true
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Programmatically correct mistyped console commands
brew "thefuck"
# Vi 'workalike' with many additional features
brew "vim"
# Utilities to create and convert Web Open Font File (WOFF) files
brew "woff2"
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community@3.6", link: true
# Stylesheet Preprocessor
brew "sass/sass/sass"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# 3D creation suite
cask "blender"
# E-books management software
cask "calibre"
# Server and cloud storage browser
cask "cyberduck"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
cask "font-fira-code"
cask "font-firacode-nerd-font"
cask "font-ibm-plex"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka-aile"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka-etoile"
cask "font-iosevka-nerd-font"
# Typeface made for developers
cask "font-jetbrains-mono"
cask "font-jetbrainsmono-nerd-font"
cask "font-source-sans-pro"
# Messaging app for WhatsApp, Facebook Messenger, Slack, Telegram and more
cask "franz"
# Web browser
cask "google-chrome"
# Tools to protect your emails and files
cask "gpg-suite"
# Link and retrieve key information
cask "hook"
cask "jeromelebel-mongohub"
# JetBrains tools manager
cask "jetbrains-toolbox"
# End-to-end encryption software
cask "keybase"
# App to manage software development and track bugs
cask "linear-linear"
# Mounts servers and cloud storages as a disk on the desktop
cask "mountain-duck"
# App to write, plan, collaborate, and get organized
cask "notion"
# Cloud storage client
cask "onedrive"
# File system integration
cask "osxfuse"
# Flexible software sketchbook and a language for learning how to code
cask "processing"
# Geographic Information System
cask "qgis"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlprettypatch"
cask "quicklook-csv"
cask "quicklook-json"
# Control your tools with a few keystrokes
cask "raycast"
# Time optimising application
cask "rescuetime"
# Block your own access to distracting websites
cask "selfcontrol"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Application for inspecting installer packages
cask "suspicious-package"
# Control windows and applications right from your trackpad
cask "swish"
# Client application for TimeCamp software - track time and change tasks
cask "timecamp"
# File transfer application
cask "transmit"
# Tool for telling interactive, nonlinear stories
cask "twine"
# Virtualizer for x86 hardware
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
mas "1Blocker", id: 1365531024
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Are.na for Safari", id: 1497800947
mas "bookmarker for pinboard", id: 1451400394
mas "Deliveries", id: 924726344
mas "Developer", id: 640199958
mas "Hush", id: 1544743900
mas "iA Writer", id: 775737590
mas "Instapaper Save", id: 1481302432
mas "Keynote", id: 409183694
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Reeder", id: 1529448980
mas "Xcode", id: 497799835
