tap "buo/cask-upgrade"
tap "dart-lang/dart"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "mas-cli/tap"
tap "sass/sass"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# XML-based font configuration API for X Windows
brew "fontconfig"
brew "fnm"
brew "nushell"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# GNU File, Shell, and Text utilities
brew "coreutils"
# C library implementing the SSH2 protocol
brew "libssh2"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Load/unload environment variables based on $PWD
brew "direnv"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Collection of GNU find, xargs, and locate
brew "findutils"
# GNU compiler collection
brew "gcc"
# Graphics library to dynamically manipulate images
brew "gd"
# Geometry Engine
brew "geos"
# File format designed to store large amounts of data
brew "hdf5"
# Cartographic Projections Library
brew "proj"
# Library and tools for dealing with GeoTIFF
brew "libgeotiff"
# GNOME XML library
brew "libxml2"
# Command-line interface for SQLite
brew "sqlite"
# Adds spatial SQL capabilities to SQLite
brew "libspatialite"
# Libraries and data formats for array-oriented scientific data
brew "netcdf"
# Package for scientific computing with Python
brew "numpy"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Geospatial Data Abstraction Library
brew "gdal"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Image manipulation
brew "netpbm"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Spell checker and morphological analyzer
brew "hunspell"
# Framework for scientific data networking
brew "libdap"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Mac App Store command-line interface
brew "mas"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: true
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Programmatically correct mistyped console commands
brew "thefuck"
# Vi 'workalike' with many additional features
brew "vim"
# Utilities to create and convert Web Open Font File (WOFF) files
brew "woff2"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# node.js dependency for heroku
brew "heroku/brew/heroku-node"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Stylesheet Preprocessor
brew "sass/sass/sass"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# 3D creation suite
cask "blender"
# E-books management software
cask "calibre"
# Server and cloud storage browser
cask "cyberduck"
# API documentation browser and code snippet manager
cask "dash"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka-aile"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka-etoile"
# Developer targeted fonts with a high number of glyphs
cask "font-iosevka-nerd-font"
# Serif font "New York" by Apple
cask "font-new-york"
# Compact variant of "San Francisco" by Apple
cask "font-sf-compact"
# Monospaced variant of "San Francisco" by Apple
cask "font-sf-mono"
# Sans-serif variant of "San Francisco" by Apple
cask "font-sf-pro"
# Web browser
cask "google-chrome"
# Link and retrieve key information
cask "hookmark"
# JetBrains tools manager
cask "jetbrains-toolbox"
# App to manage software development and track bugs
cask "linear-linear"
# Mounts servers and cloud storages as a disk on the desktop
cask "mountain-duck"
# App to write, plan, collaborate, and get organized
cask "notion"
# Cloud storage client
cask "onedrive"
# Geographic Information System
cask "qgis"
# Control your tools with a few keystrokes
cask "raycast"
# Time optimising application
cask "rescuetime"
# Block your own access to distracting websites
cask "selfcontrol"
# Team communication and collaboration software
cask "slack"
# Control windows and applications right from your trackpad
cask "swish"
# Client application for TimeCamp software - track time and change tasks
cask "timecamp"
# Open-source code editor
cask "visual-studio-code"
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Are.na for Safari", id: 1497800947
mas "bookmarker for pinboard", id: 1451400394
mas "Home Assistant", id: 1099568401
mas "iA Writer", id: 775737590
mas "Keynote", id: 409183694
mas "Nautomate", id: 1608529689
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "one sec", id: 1532875441
mas "Pages", id: 409201541
mas "Pins", id: 1547106997
mas "Save to Reader", id: 1640236961
mas "TestFlight", id: 899247664
mas "Velja", id: 1607635845
mas "Xcode", id: 497799835
